{
  "documentTitle": "Ivan Maculan - Professional Portfolio",
  "language": {
    "label": "Language",
    "options": {
      "eng": "English",
      "it": "Italian"
    }
  },
  "header": {
    "name": "Ivan Maculan",
    "title": "<strong>Senior Project & Engineering Manager | Product Leader | Technical Strategist | AI Enthusiast</strong>",
    "contact": "Turin, Italy | <a href=\"mailto:ivan.maculan@gmail.com\">ivan.maculan@gmail.com</a> | <a href=\"https://www.linkedin.com/in/ivanmaculan\" target=\"_blank\">LinkedIn</a>"
  },
  "about": {
    "title": "PROFESSIONAL PROFILE",
    "body": "<p>Project Manager and Program Manager with over 15 years of experience leading ICT and cloud transformation programs on a global scale, with a focus on digital transformation, enterprise scalability, and application modernization. Specialized in the end-to-end governance of complex programs across multi-cloud environments (AWS, Azure, GCP, OCI), combining leadership, strategic planning, budget control, and coordination of global stakeholders and vendors.</p><p>I have led major initiatives for enterprise clients such as British Telecom, Fastweb, Poste Italiane, Swisscom, SoftBank, Altice USA, and InfoCert, ensuring time-to-market, delivery quality, risk management, and operational continuity for mission-critical platforms.</p><p>Strong experience in the technical leadership of Professional Services teams and close collaboration with Engineering to align business requirements, software architecture, security, technical delivery, and product roadmap.</p><p>AI enthusiast: experimentation and adoption of Generative AI solutions to enhance productivity, automation, knowledge management, and decision-making in delivery processes. Skilled in prompt engineering, RAG architectures, and enterprise AI application.</p><p>Collaborative and innovation-driven approach, with focus on KPI/OKR-based execution and operational excellence enabled by Agile and DevOps methodologies. Proficient in tools such as Jira, Tempo Timesheets, Confluence, MS Project, Bamboo, Git, and Jenkins.</p>"
  },
  "competencies": {
    "title": "Key Competencies",
    "list": "<p><strong>Leadership & Delivery:</strong> Technical leadership, Agile team management, stakeholder engagement, mentoring, blocker removal, performance management.</p><p><strong>Software Development:</strong> Java (Full Stack), Node.js, React, HTML/CSS/JS, microservices, REST API.</p><p><strong>Cloud & DevOps:</strong> AWS, Azure, Google Cloud Platform (GCP), Docker, virtualization, containers, CI/CD (Jira, Bamboo, Git, Jenkins), monitoring & performance testing.</p><p><strong>Architecture & Security:</strong> Scalable and secure architectures, SSO, MFA, PKI, GDPR compliance, encryption (AES, 3DES).</p><p><strong>Testing & Quality:</strong> TDD, unit/integration testing, QA best practices, continuous quality monitoring.</p><p><strong>Client Management:</strong> Direct customer engagement, pre-sales, technical demos (POC), solution customization, long-term account development, alignment between client needs and technical execution.</p><p><strong>Product Strategy:</strong> Reusable and market-ready solutions, product innovation, go-to-market support, alignment between business vision and technical execution.</p><p><strong>AI & Emerging Technologies:</strong> Generative AI, prompt engineering, RAG architectures, foundational Web3 & Blockchain knowledge, ethical AI adoption.</p>"
  },
  "roles": {
    "title": "Key Roles",
    "list": "<p><strong>Technical Leader – Engineering & Professional Services</strong><br>Oversight of large-scale digital programs and technical leadership of Professional Services teams. Accountable for global enterprise webmail deployments with focus on cloud-native architectures, security, and delivery governance. Technical leadership for clients including British Telecom, SoftBank, KDDI, Altice USA, Fastweb, InfoCert, and Reevo.</p><p><strong>Cloud Migration & Modernization Specialist</strong><br>Led enterprise migrations from on-premise environments to the cloud (AWS, Oracle Cloud Infrastructure – OCI, Google Cloud Platform – GCP, Azure), ensuring operational continuity, security, and cost optimization. Hands-on experience in cloud-to-cloud migration, re-platforming, secure data transfer, architectural review, and compliance alignment. Full lifecycle ownership from assessment and planning to execution and post-migration validation for high-availability systems.</p><p><strong>Product Strategist & Solution Architect</strong><br>Design and technical management of modular and reusable enterprise solutions with high ROI, including: Modular Provisioning Solution, Delegated Admin Console, Legal Intercept Platform, Business Analytics Dashboard, and PEC systems. Pre-sales support and account management for TIM, Fastweb, Swisscom, and Vodafone.</p><p><strong>Program Manager & Cross-Functional Team Coordinator</strong><br>Management of complex multi-country programs and alignment between technical delivery, product roadmap, and business goals. Stakeholder coordination for Poste Italiane, Bell Canada, and TIM.</p><p><strong>Solution Architect & Engineering Team Lead</strong><br>Definition of scalable microservices architectures, introduction of DevOps/CI-CD practices, and technical mentoring of distributed teams. Projects for Swisscom, Telia Company, Proximus, and Altice.</p><p><strong>Senior Developer & Technical Lead</strong><br>Development of high-performance platforms (Java, Node.js, React), integration with AWS/Azure/GCP, SSO/MFA compliance, WCAG standards. Projects for Libero, Virgilio, and Vodafone.</p><p><strong>Solution Designer</strong><br>Design of custom messaging systems for public and private clients. Projects with Vodafone Italy and Poste Italiane, including high-scale mission-critical deployments.</p>"
  },
  "projects": {
    "title": "Key Projects",
    "content": "<ul><li>Global coordination of enterprise webmail deployments in high-availability multi-tenant environments.</li><li>Cloud migration from legacy on-premise to AWS, Azure, and GCP for Telco and public-sector clients.</li><li>Cloud-to-cloud migration from AWS to OCI/Azure for large-scale platforms.</li><li>Implementation of container-based architectures with Docker and Kubernetes.</li><li>Integration of PEC and legal intercept systems in compliant cloud environments.</li><li>Delivery of enterprise user provisioning platforms and central admin consoles.</li><li>Introduction of CI/CD pipelines and DevOps practices in regulated multi-country environments.</li><li>Definition of portable, standardized development environments based on Docker for international teams.</li><li>Multi-country coordination aligning technical roadmap with corporate strategic goals.</li><li>Design and deployment of KPI dashboards for high-volume messaging platforms.</li><li>GDPR audits and compliance with federated access and advanced encryption.</li><li>Pre-sales support and technical account management for key Telco and digital services customers.</li><li>Implementation of resilient microservices architectures for mission-critical systems.</li><li>Application modernization and re-platforming from legacy monolithic stacks.</li><li>Technical delivery governance across product, sales, and operations organizations.</li><li>Performance optimization and database tuning for Oracle and PostgreSQL in enterprise environments.</li></ul>"
  },
  "products": {
    "title": "Managed Products",
    "list": "<ul><li>Modular Provisioning Solution – scalable and easily integrable system for onboarding and migrations.</li><li>Delegated Admin Console – customizable multi-tenant administration console.</li><li>Legal Intercept Platform – compliance solution for telecom environments.</li><li>Business Analytics Dashboard – data-driven insights on platform usage and operations.</li><li>Certified Email (PEC) Platform – secure and regulation-compliant email system.</li></ul>"
  },
  "ai": {
    "title": "🤖 AI Enthusiast",
    "body": "<p>In recent years, I have deepened my expertise in Artificial Intelligence, focusing on how to integrate AI into enterprise platforms and product strategies. Key areas include:</p><ul><li>Experimentation with Generative AI for project management, product innovation, and customer engagement.</li><li>Development of prompt engineering skills and LLM fine-tuning for business-specific use cases.</li><li>Exploration of Retrieval-Augmented Generation (RAG) to enhance knowledge access and organizational decision-making.</li><li>Use of AI to automate DevOps workflows and cloud-native environments.</li><li>Advocacy for ethical, compliant, and human-centric AI implementation.</li></ul><p>This journey reflects my passion for continuous learning and my commitment to applying AI responsibly to maximize value for organizations and end-users.</p>"
  },
  "recommendations": {
    "title": "Recommendations",
    "body": "<p>Throughout my career, I have received numerous testimonials from colleagues, managers, and clients worldwide highlighting:</p><ul><li><strong>Leadership & Teamwork:</strong> Professionalism, dedication, and ability to manage complex global initiatives (Josh Cohen, Ronan Kelly).</li><li><strong>Technical Expertise:</strong> Deep knowledge of software architectures, scalable APIs, and innovative problem-solving (Atul Bhatia, Jaikishan Khatwani).</li><li><strong>Client Relationship:</strong> Clear communication, bridging business needs and technical delivery, high-quality outcomes (Harrison Bliss, Mike Mohammed).</li><li><strong>Collaboration & Mentoring:</strong> Active listening, team motivation, and supportive leadership style (Francesco D'Agostino, Gianluca Baragiotta, Simón de Frosterus, Patrick Gnägi).</li></ul><p>Full references available on my LinkedIn profile.</p>"
  },
  "footer": {
    "text": "&copy; 2025 Ivan Maculan – All rights reserved"
  }
}
