{
  "documentTitle": "Ivan Maculan - Portfolio Professionale",
  "language": {
    "label": "Lingua",
    "options": {
      "eng": "Inglese",
      "it": "Italiano"
    }
  },
  "header": {
    "name": "Ivan Maculan",
    "title": "<strong>Senior Project &amp; Engineering Manager | Product Leader | Technical Strategist</strong>",
    "contact": "Torino, Italia | <a href=\"mailto:ivan.maculan@gmail.com\">ivan.maculan@gmail.com</a> | <a href=\"https://www.linkedin.com/in/ivanmaculan\" target=\"_blank\">LinkedIn</a>"
  },
  "about": {
    "title": "Chi sono",
    "body": "<p>Project Manager e Program Manager con oltre 15 anni di esperienza nella gestione di progetti ICT e cloud internazionali. Specializzato nella governance end-to-end di iniziative complesse in ambienti multi-cloud, integrando competenze di leadership, pianificazione e controllo economico.</p><p>Ha guidato programmi di trasformazione digitale per clienti enterprise come British Telecom e Fastweb, garantendo risultati concreti attraverso un approccio orientato alla collaborazione, all'innovazione e al miglioramento continuo.</p><p>Esperienza consolidata nella guida tecnica dei team di Professional Services e nel coordinamento con i team Engineering, assicurando allineamento tra requisiti di business, definizione architetturale e implementazione tecnica.</p><p>AI enthusiast, con forte interesse per l'adozione di soluzioni di intelligenza artificiale a supporto della produttività, della customer experience e dell'ottimizzazione dei processi IT. Applicazione costante di metodologie Agile e DevOps e utilizzo di strumenti di tracciamento (Jira, Tempo Timesheets) per monitorare avanzamento, effort e performance di progetto.</p>"
  },
  "roles": {
    "title": "Ruoli Principali",
    "list": "<strong>Technical Leader – Engineering & Professional Services</strong><br>Supervisione di progetti digitali su larga scala e guida tecnica dei team di <strong>Professional Services</strong>. Responsabile di tutte le <strong>implementazioni webmail a livello globale</strong>, con focus su architetture cloud-native, sicurezza enterprise e governance della delivery. Leadership tecnica per clienti come <em>British Telecom, SoftBank, KDDI, Altice USA, Fastweb, InfoCert, Reevo</em>.<br><br><strong>Cloud Migration & Modernization Specialist</strong><br>Responsabile della migrazione di clienti enterprise da soluzioni <strong>on-premise verso ambienti cloud</strong> (AWS, Oracle Cloud Infrastructure – OCI, Google Cloud Platform – GCP, Azure), garantendo continuità operativa, sicurezza e ottimizzazione dei costi. Esperienza in progetti di <strong>migrazione cloud-to-cloud</strong>, con attività di re-platforming, data transfer sicuro, revisione architetturale e riallineamento compliance. Gestione end-to-end di assessment, pianificazione, esecuzione tecnica e validazione post-migrazione per infrastrutture critiche ad alta disponibilità.<br><br><strong>Program Manager & Cross-Functional Team Coordinator</strong><br>Gestione di programmi complessi multi-country e allineamento tra delivery tecnica, roadmap di prodotto e obiettivi di business. Coordinamento di stakeholder per <em>Poste Italiane, Bell Canada, TIM</em>.<br><br><strong>Solution Architect & Engineering Team Lead</strong><br>Definizione di architetture a microservizi scalabili, introduzione DevOps/CI-CD, mentoring tecnico di team distribuiti. Progetti per <em>Swisscom, Telia Company, Proximus, Altice</em>.<br><br><strong>Senior Developer & Technical Lead</strong><br>Sviluppo di piattaforme ad alte prestazioni (Java, Node.js, React), integrazione con AWS/Azure/GCP, conformità a standard SSO, MFA, WCAG. Progetti per <em>Libero, Virgilio, Vodafone</em>.<br><br><strong>Product Strategist & Solution Architect</strong><br>Progettazione e gestione tecnica di soluzioni modulari e riutilizzabili ad alto ROI. Prodotti: <em>Modular Provisioning Solution, Delegated Admin Console, Piattaforma di Intercettazione Legale, Business Analytics Dashboard, Posta Elettronica Certificata (PEC)</em>. Gestione account e supporto prevendita per <em>TIM, Fastweb, Swisscom, Vodafone</em>.<br><br><strong>Solution Designer</strong><br>Sviluppo di sistemi di messaggistica su misura per clienti pubblici e privati. Esperienze con <em>Vodafone Italia, Poste Italiane</em>, incluse implementazioni mission-critical ad alta scalabilità."
  },
  "products": {
    "title": "Prodotti di Punta",
    "list": "<ul><li><strong>Modular Provisioning Solution</strong> – sistema scalabile per onboarding e gestione</li><li><strong>Delegated Admin Console</strong> – console di amministrazione multi-tenant personalizzabile</li><li><strong>Piattaforma di Intercettazione Legale</strong> – soluzione di compliance integrata negli ambienti telco</li><li><strong>Business Analytics Dashboard</strong> – insight data-driven su utilizzo e operazioni</li><li><strong>Posta Elettronica Certificata (PEC)</strong> – sistema email sicuro e conforme alle normative</li></ul>"
  },
  "projects": {
    "title": "Progetti Chiave",
    "content": "<ul><li><strong>Coordinamento globale</strong> delle implementazioni <strong>webmail enterprise</strong> in ambienti <strong>multi-tenant</strong> ad alta disponibilità.</li><li>Progetto di <strong>migrazione cloud</strong> da infrastrutture legacy <strong>on-premise</strong> a <strong>AWS</strong> per clienti Telco e PA.</li><li><strong>Pianificazione e gestione</strong> di una <strong>migrazione cloud-to-cloud</strong> da <strong>Azure</strong> a <strong>GCP</strong> per piattaforme ad alto traffico.</li><li>Implementazione di architetture containerizzate con <strong>Docker</strong> e <strong>Kubernetes</strong> per ambienti distribuiti.</li><li>Definizione di un <strong>ambiente di sviluppo standardizzato</strong> e portabile per team internazionali basato su <strong>Docker</strong>.</li><li>Gestione dell’integrazione di <strong>PEC</strong> e sistemi di <strong>intercettazione legale</strong> in infrastrutture cloud compliant.</li><li>Delivery di piattaforme di <strong>provisioning utenti</strong> e <strong>console di amministrazione</strong> centralizzata a livello enterprise.</li><li>Introduzione di <strong>pipeline CI/CD</strong> e pratiche <strong>DevOps</strong> in contesti regolamentati multi-paese.</li><li><strong>Coordinamento multi-country</strong> per allineamento tra <strong>roadmap tecnica</strong> e obiettivi strategici corporate.</li><li>Sviluppo e rilascio di <strong>dashboard analitiche</strong> per <strong>monitoraggio KPI</strong> su piattaforme di messaging massive.</li><li>Conduzione di <strong>audit</strong> e adeguamenti <strong>GDPR</strong> in ambienti cloud con accessi federati e <strong>crittografia avanzata</strong>.</li><li>Supporto <strong>prevendita</strong> e <strong>gestione tecnica</strong> di account chiave in ambito Telco e servizi digitali certificati.</li><li>Implementazione di architetture a <strong>microservizi resilienti</strong> per sistemi di comunicazione mission-critical.</li><li><strong>Modernizzazione applicativa</strong> e <strong>re-platforming</strong> per la sostituzione di stack monolitici legacy.</li><li>Supervisione della <strong>delivery tecnica</strong> per programmi interfunzionali tra <strong>product</strong>, <strong>vendite</strong> e <strong>operation</strong>.</li><li><strong>Ottimizzazione performance</strong> e <strong>tuning</strong> di <strong>database Oracle e Postgress</strong> per ambienti enterprise ad alta concorrenza.</li></ul>"
  },
  "competencies": {
    "title": "Competenze Chiave",
    "list": "<ul><li><strong>Leadership &amp; Delivery</strong>: Leadership tecnica, gestione team Agile, coinvolgimento stakeholder, mentoring, rimozione dei blocker, performance management.</li><li><strong>Sviluppo Software</strong>: Java (Full Stack), Node.js, React, HTML/CSS/JS, Microservizi, REST API.</li><li><strong>Cloud &amp; DevOps</strong>: AWS, Azure, Google Cloud Platform (GCP), Docker, Virtualizzazione, Container, Infrastructure as Code (IaC), CI/CD (Jira, Bamboo, Git, Jenkins), Monitoring &amp; Performance Testing.</li><li><strong>Architettura &amp; Sicurezza</strong>: Architetture scalabili e sicure, SSO, MFA, PKI, conformità GDPR, cifratura (AES, 3DES).</li><li><strong>Testing &amp; Qualità</strong>: TDD, test unitari/integrati, best practice QA, monitoraggio continuo della qualità.</li><li><strong>Gestione Cliente</strong>: Relazione diretta, pre-sales, demo tecniche, personalizzazione di soluzioni, crescita a lungo termine degli account, collegamento tra esigenze del cliente ed esecuzione tecnica.</li><li><strong>Product Strategy</strong>: Soluzioni riusabili pronte per il mercato, innovazione di prodotto, supporto go-to-market, allineamento tra visione business ed execution tecnica.</li><li><strong>AI &amp; Tecnologie Emergenti</strong>: Generative AI, Prompt Engineering, architetture RAG, fondamenti Web3 e Blockchain, adozione etica dell'AI.</li></ul>"
  },
  "ai": {
    "title": "🤖 AI Enthusiast",
    "body": "<p>Negli ultimi anni ho approfondito le mie competenze in <span class=\"highlight\">Intelligenza Artificiale</span>, concentrandomi su come integrare l'AI nelle strategie di prodotto e nelle piattaforme enterprise. Il mio percorso include:</p><ul><li>Sperimentazione con <strong>Generative AI</strong> per project management, innovazione di prodotto e customer engagement.</li><li>Sviluppo di competenze in <strong>Prompt Engineering</strong> e <strong>fine-tuning di LLM</strong> per esigenze business specifiche.</li><li>Esplorazione della <strong>Retrieval-Augmented Generation (RAG)</strong> per migliorare la gestione della conoscenza e le decisioni in azienda.</li><li>Utilizzo dell'AI per <strong>automazione DevOps</strong> e <strong>ambienti cloud-native</strong>.</li><li>Promozione di un'adozione etica dell'AI, con attenzione a compliance e human-centered design.</li></ul><p>Questo percorso riflette la mia passione per l'apprendimento continuo e l'impegno ad applicare l'AI in modo responsabile per massimizzare il valore per aziende e utenti finali.</p><h3>Certificazioni Correlate</h3><ul><li><a href=\"https://www.coursera.org/account/accomplishments/verify/MD970U5NTV03\" target=\"_blank\">Generative AI for Project Managers – Coursera (2025)</a></li><li><a href=\"https://www.coursera.org/account/accomplishments/verify/6CJCCHTH7B8N\" target=\"_blank\">OpenAI GPTs: Create Your Custom GPTs – Coursera (2025)</a></li><li><a href=\"https://www.coursera.org/account/accomplishments/verify/8OO559LXUODD\" target=\"_blank\">AWS Cloud Technical Essentials – Coursera (2025)</a></li><li><a href=\"https://www.coursera.org/account/accomplishments/verify/6CJCCHTH7B8N\" target=\"_blank\">LLM Engineering with Retrieval-Augmented Generation (RAG) – Coursera (2025)</a></li></ul>"
  },
  "recommendations": {
    "title": "Raccomandazioni",
    "body": "<p>Nel corso della mia carriera ho ricevuto numerose testimonianze da colleghi, manager e clienti in tutto il mondo. I punti principali includono:</p><ul><li><strong>Leadership &amp; Teamwork</strong>: Professionalità, dedizione e capacità di gestire progetti complessi con stakeholder globali (Josh Cohen, Ronan Kelly).</li><li><strong>Competenza Tecnica</strong>: Profonda conoscenza di architetture software, API scalabili e problem solving con soluzioni innovative (Atul Bhatia, Jaikishan Khatwani).</li><li><strong>Relazione con il Cliente</strong>: Comunicazione chiara, ponte tra esigenze del cliente e delivery tecnica, risultati di alta qualità (Harrison Bliss, Mike Mohammed).</li><li><strong>Collaborazione &amp; Mentoring</strong>: Capacità di ascolto, motivazione dei team e guida dei colleghi con fiducia ed empatia (Francesco D'Agostino, Gianluca Baragiotta, Simón de Frosterus, Patrick Gnägi).</li></ul><p>Le raccomandazioni complete sono disponibili sul mio <a href=\"https://www.linkedin.com/in/ivanmaculan/details/recommendations/\" target=\"_blank\">profilo LinkedIn</a>.</p>"
  },
  "customers": {
    "title": "Clienti"
  },
  "footer": {
    "text": "&copy; 2025 Ivan Maculan – Tutti i diritti riservati"
  }
}
